app/Views/frontend/ultimate/navigation.php

SELECT *
FROM `user_schools`
WHERE `user_id` = '266'
AND school_id IS NOT NULL
---
$current_user_id = $session->get('user_id');

if ($current_user_id) {
    $user_schools = $db->table('user_schools')->where('user_id', $current_user_id)->where('school_id IS NOT NULL', null, false)->get()->getResult();