app/Views/backend/header.php

// Vérifier si l'utilisateur appartient vraiment à l'école active
$user_belongs_to_school = false;
if ($active_school_id && $user_id) {
    $user_school_check = $this->db->table('user_schools')->where('user_id', $user_id)->where('school_id', $active_school_id)->get()->getRow();
---
SELECT *
FROM `user_schools`
WHERE `user_id` = '266'
AND `school_id` = '93'


// Récupère le nom de la communauté SEULEMENT si l'utilisateur y appartient
if ($active_school_id && $user_belongs_to_school) {
    $school = $this->db->table('schools')->select('name as community_name')->where('id', $active_school_id)->get()->getRow();
---
SELECT `name` as `community_name`
FROM `schools`
WHERE `id` = '93'

        $current_name = $school->community_name;
    }
    // Récupère le rôle dans user_schools
    $user_school = $this->db->table('user_schools')->select('role')->where('user_id', $user_id)->where('school_id', $active_school_id)->get()->getRow();
---
SELECT `role`
FROM `user_schools`
WHERE `user_id` = '266'
AND `school_id` = '93'

                    <span>
                        <span class="account-user-name"><?php echo $user_name; ?></span>
                        <?php
                            $role_raw = $this->db->table('users')->where('id', $user_id)->get()->getRow('role');
---
SELECT *
FROM `users`
WHERE `id` = '266'