app/Views/backend/metas.php

SELECT *
FROM `schools`
WHERE `id` = '93'
---
        if ($school_id > 0) {
            $active_school_id = session()->get('active_school_id');
            if (!empty($active_school_id)) {
                echo ' | ' . $this->db->table('schools')->where('id', $active_school_id)->get()->getRow('name');