app/Models/Crud_model.php

                ]
            );
        } else {
            $audit_log_model->log_attendance_take(
                session()->get('user_id'),
                [
                    'date' => date('Y-m-d', $timestamp),
                    'class_id' => $class_id,
                    'session_id' => $session_id,
                    'school_id' => $school_id,
                    'total_students' => $total_students,
                    'present_count' => $present_count,
                    'absent_count' => $absent_count,
                    'is_update' => false
                ]
            );
---
SELECT COUNT(*) AS `numrows`
FROM `attendance`
WHERE `school_id` = '93'
AND `date` = '2026-04-02'