app/Models/User_model.php

SELECT *
FROM `users`
WHERE `id` = '266'
---
	public function get_user_details($user_id = '', $column_name = '')
	{
		if (empty($user_id)) {
			$user_id = session()->get('user_id');
		}

		if (empty($user_id)) {
			return null;
		}

		if ($column_name != '') {
			$result = \db()->table('users')->where('id', $user_id)->get()->getRow($column_name);
			return $result;
		} else {
			return \db()->table('users')->where('id', $user_id)->get()->getRowArray();