app/Views/backend/admin/student/update.php


    // Fallback for full-page edit route (admin/student/edit/{id}) when modal_* payload is not set.
    if (empty($student) && $student_id > 0) {
        $student = $this->db->table('students')->where('id', $student_id)->get()->getRowArray() ?? [];
---
SELECT *
FROM `students`
WHERE `id` = 179

            if ($target_school_id <= 0) {
                $target_school_id = (int) $school_id;
            }
            $classes = $this->db->table('classes')
                ->where('school_id', $target_school_id)
                ->get()
                ->getResultArray();
---
SELECT *
FROM `classes`
WHERE `school_id` = 93