app/Views/create_community_modal.php

                    <label for="category"><?php echo get_phrase("Category") ?><span class="required-star">*</span></label>
                    <select id="category" name="category" class="form-input-community" required data-msg="<?php echo get_phrase("please_select_a_category"); ?>">
                        <option value=""><?php echo get_phrase('select_a_category'); ?></option>
                        <?php $categories = $this->db->table('categories')->get()->getResultArray(); ?>
---
SELECT *
FROM `categories`